import 'package:get/get.dart';

class Translate extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'en': {
          'ورود': 'login',
          'لطفا شماره خود را وارد کنید.': 'Please enter your phone number',
          'پیامک به این شماره ارسال خواهد شد:':
              'SMS will be sent to this number',
          'مرحله بعد': 'next',
          'شماره موبایل را وارد کنید.': 'Enter your phone number'
        },
        'fa': {
          'ورود': 'ورود',
          'لطفا شماره خود را وارد کنید.': 'لطفا شماره خود را وارد کنید.',
          'پیامک به این شماره ارسال خواهد شد:':
              'پیامک به این شماره ارسال خواهد شد:',
          'مرحله بعد': 'مرحله بعد',
          'شماره موبایل را وارد کنید.': 'شماره موبایل را وارد کنید.'
        },
        'ar': {
          'ورود': 'ورود',
          'لطفا شماره خود را وارد کنید.': 'من فضلک ادخل رقم هاتفک',
          'پیامک به این شماره ارسال خواهد شد:':
              'سیتم ارسال الرسائل القصیره الی هذا الرقم',
          'مرحله بعد': 'الخطوه التالیه',
          'شماره موبایل را وارد کنید.': 'ادخل رقم الجوال'
        }
      };
}
